% Пароход Northern Clipper
% Эксперименты с визуальным управлением
% Вначале открой posi_vizual,
% а затем запусти этот файл!
% Он настроит и запустит модель!

clear all;

global m L m11 m22 m33 d11 d22 d33 d23 d32;

% Задание параметров парохода
m  = 4.591e6;                % Масса в кг
L  = 76.2;                   % Длина в м 
% Матрица и параметры инерции
M  = diag([5.3122e6  8.2831e6 3.7454e9]); 
M1 = inv(M);
m11 = M1(1,1); m22=M1(2,2); m33=M1(3,3);
% Матрица и параметры демпфирования
D  = [5.0242e4      0          0;
          0      2.7229e5  -4.3933e6;
          0     -4.3933e6   4.1894e8];
D1=M1*D;
d11=D1(1,1);  d22=D1(2,2); d23=D1(2,3);  
              d32=D1(3,2); d33=D1(3,3);

% Старт модели
sim('posi_vizual');
